---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.BendingDetailAngularDimensionsDisplayOptions.AllAngles
enum: Autodesk.Revit.DB.Structure.BendingDetailAngularDimensionsDisplayOptions
source: html/78ee1054-d537-da6f-f244-adc2bdc84408.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailAngularDimensionsDisplayOptions.AllAngles

Display for all angle values.